data/1-replicas/1-producers/1-consumers/55-throughput/0-trial/producer.txt
2018-11-24 06:06:49, 333747 records sent, 66749.4 records/sec (32.59 MB/sec), 746.8 ms avg latency, 1214.0 max latency.
2018-11-24 06:06:54, 403930 records sent, 80786.0 records/sec (39.45 MB/sec), 796.8 ms avg latency, 889.0 max latency.
2018-11-24 06:06:59, 386291 records sent, 77258.2 records/sec (37.72 MB/sec), 805.4 ms avg latency, 877.0 max latency.
2018-11-24 06:07:04, 359104 records sent, 71820.8 records/sec (35.07 MB/sec), 884.9 ms avg latency, 909.0 max latency.
2018-11-24 06:07:09, 357678 records sent, 71535.6 records/sec (34.93 MB/sec), 887.8 ms avg latency, 912.0 max latency.
2018-11-24 06:07:14, 367195 records sent, 73439.0 records/sec (35.86 MB/sec), 867.1 ms avg latency, 909.0 max latency.
2018-11-24 06:07:19, 384493 records sent, 76898.6 records/sec (37.55 MB/sec), 824.1 ms avg latency, 861.0 max latency.
2018-11-24 06:07:24, 358732 records sent, 71746.4 records/sec (35.03 MB/sec), 883.5 ms avg latency, 901.0 max latency.
2018-11-24 06:07:29, 382292 records sent, 76458.4 records/sec (37.33 MB/sec), 832.7 ms avg latency, 904.0 max latency.
2018-11-24 06:07:34, 358484 records sent, 71696.8 records/sec (35.01 MB/sec), 882.4 ms avg latency, 911.0 max latency.
2018-11-24 06:07:39, 373488 records sent, 74697.6 records/sec (36.47 MB/sec), 861.5 ms avg latency, 902.0 max latency.
2018-11-24 06:07:44, 393390 records sent, 78678.0 records/sec (38.42 MB/sec), 799.7 ms avg latency, 858.0 max latency.
2018-11-24 06:07:49, 364932 records sent, 72986.4 records/sec (35.64 MB/sec), 866.1 ms avg latency, 905.0 max latency.
2018-11-24 06:07:54, 360964 records sent, 72192.8 records/sec (35.25 MB/sec), 880.2 ms avg latency, 905.0 max latency.
2018-11-24 06:07:59, 409417 records sent, 81883.4 records/sec (39.98 MB/sec), 777.9 ms avg latency, 903.0 max latency.
2018-11-24 06:08:04, 364808 records sent, 72961.6 records/sec (35.63 MB/sec), 868.2 ms avg latency, 912.0 max latency.
2018-11-24 06:08:09, 367226 records sent, 73445.2 records/sec (35.86 MB/sec), 865.9 ms avg latency, 913.0 max latency.
2018-11-24 06:08:14, 366823 records sent, 73364.6 records/sec (35.82 MB/sec), 863.1 ms avg latency, 898.0 max latency.
2018-11-24 06:08:19, 365180 records sent, 73036.0 records/sec (35.66 MB/sec), 871.7 ms avg latency, 916.0 max latency.
2018-11-24 06:08:24, 369675 records sent, 73935.0 records/sec (36.10 MB/sec), 857.6 ms avg latency, 878.0 max latency.
2018-11-24 06:08:29, 371876 records sent, 74375.2 records/sec (36.32 MB/sec), 859.6 ms avg latency, 889.0 max latency.
2018-11-24 06:08:34, 383098 records sent, 76619.6 records/sec (37.41 MB/sec), 821.9 ms avg latency, 866.0 max latency.
2018-11-24 06:08:39, 386043 records sent, 77208.6 records/sec (37.70 MB/sec), 830.9 ms avg latency, 893.0 max latency.
2018-11-24 06:08:44, 377363 records sent, 75472.6 records/sec (36.85 MB/sec), 836.2 ms avg latency, 888.0 max latency.
2018-11-24 06:08:49, 375751 records sent, 75150.2 records/sec (36.69 MB/sec), 840.2 ms avg latency, 868.0 max latency.
2018-11-24 06:08:54, 375317 records sent, 75063.4 records/sec (36.65 MB/sec), 849.5 ms avg latency, 881.0 max latency.
2018-11-24 06:08:59, 383935 records sent, 76787.0 records/sec (37.49 MB/sec), 824.9 ms avg latency, 849.0 max latency.
2018-11-24 06:09:04, 375751 records sent, 75150.2 records/sec (36.69 MB/sec), 846.6 ms avg latency, 892.0 max latency.
2018-11-24 06:09:09, 373581 records sent, 74716.2 records/sec (36.48 MB/sec), 845.8 ms avg latency, 883.0 max latency.
2018-11-24 06:09:14, 369923 records sent, 73984.6 records/sec (36.13 MB/sec), 858.7 ms avg latency, 881.0 max latency.
2018-11-24 06:09:19, 362204 records sent, 72440.8 records/sec (35.37 MB/sec), 877.5 ms avg latency, 896.0 max latency.
2018-11-24 06:09:24, 377983 records sent, 75596.6 records/sec (36.91 MB/sec), 838.5 ms avg latency, 888.0 max latency.
2018-11-24 06:09:29, 367536 records sent, 73507.2 records/sec (35.89 MB/sec), 865.7 ms avg latency, 896.0 max latency.
2018-11-24 06:09:34, 378479 records sent, 75695.8 records/sec (36.96 MB/sec), 841.3 ms avg latency, 881.0 max latency.
2018-11-24 06:09:39, 366606 records sent, 73321.2 records/sec (35.80 MB/sec), 858.4 ms avg latency, 908.0 max latency.
2018-11-24 06:09:44, 354020 records sent, 70804.0 records/sec (34.57 MB/sec), 895.4 ms avg latency, 923.0 max latency.
2018-11-24 06:09:49, 351540 records sent, 70308.0 records/sec (34.33 MB/sec), 908.6 ms avg latency, 949.0 max latency.
2018-11-24 06:09:54, 369613 records sent, 73922.6 records/sec (36.10 MB/sec), 857.4 ms avg latency, 896.0 max latency.
2018-11-24 06:09:59, 368249 records sent, 73649.8 records/sec (35.96 MB/sec), 865.3 ms avg latency, 900.0 max latency.
2018-11-24 06:10:04, 378572 records sent, 75714.4 records/sec (36.97 MB/sec), 836.9 ms avg latency, 870.0 max latency.
2018-11-24 06:10:09, 380556 records sent, 76111.2 records/sec (37.16 MB/sec), 833.5 ms avg latency, 864.0 max latency.
2018-11-24 06:10:14, 373054 records sent, 74610.8 records/sec (36.43 MB/sec), 854.3 ms avg latency, 891.0 max latency.
2018-11-24 06:10:19, 380463 records sent, 76092.6 records/sec (37.15 MB/sec), 832.0 ms avg latency, 859.0 max latency.
2018-11-24 06:10:24, 369055 records sent, 73811.0 records/sec (36.04 MB/sec), 859.8 ms avg latency, 875.0 max latency.
2018-11-24 06:10:29, 379254 records sent, 75850.8 records/sec (37.04 MB/sec), 836.6 ms avg latency, 878.0 max latency.
2018-11-24 06:10:34, 360995 records sent, 72199.0 records/sec (35.25 MB/sec), 880.9 ms avg latency, 905.0 max latency.
2018-11-24 06:10:39, 370264 records sent, 74052.8 records/sec (36.16 MB/sec), 855.1 ms avg latency, 882.0 max latency.
2018-11-24 06:10:44, 364374 records sent, 72874.8 records/sec (35.58 MB/sec), 871.3 ms avg latency, 890.0 max latency.
2018-11-24 06:10:49, 368063 records sent, 73612.6 records/sec (35.94 MB/sec), 862.8 ms avg latency, 897.0 max latency.
2018-11-24 06:10:54, 362235 records sent, 72447.0 records/sec (35.37 MB/sec), 876.9 ms avg latency, 909.0 max latency.
2018-11-24 06:10:59, 367784 records sent, 73556.8 records/sec (35.92 MB/sec), 861.1 ms avg latency, 894.0 max latency.
2018-11-24 06:11:04, 380587 records sent, 76117.4 records/sec (37.17 MB/sec), 852.4 ms avg latency, 887.0 max latency.
2018-11-24 06:11:09, 380742 records sent, 76148.4 records/sec (37.18 MB/sec), 816.6 ms avg latency, 859.0 max latency.
2018-11-24 06:11:14, 341620 records sent, 68324.0 records/sec (33.36 MB/sec), 922.1 ms avg latency, 941.0 max latency.
2018-11-24 06:11:19, 364684 records sent, 72936.8 records/sec (35.61 MB/sec), 875.0 ms avg latency, 937.0 max latency.
2018-11-24 06:11:24, 368807 records sent, 73761.4 records/sec (36.02 MB/sec), 867.8 ms avg latency, 906.0 max latency.
2018-11-24 06:11:29, 360034 records sent, 72006.8 records/sec (35.16 MB/sec), 874.2 ms avg latency, 923.0 max latency.
2018-11-24 06:11:34, 368466 records sent, 73693.2 records/sec (35.98 MB/sec), 866.3 ms avg latency, 897.0 max latency.
2018-11-24 06:11:39, 375503 records sent, 75100.6 records/sec (36.67 MB/sec), 841.5 ms avg latency, 895.0 max latency.
2018-11-24 06:11:44, 361832 records sent, 72366.4 records/sec (35.34 MB/sec), 878.0 ms avg latency, 892.0 max latency.
2018-11-24 06:11:49, 363537 records sent, 72707.4 records/sec (35.50 MB/sec), 871.4 ms avg latency, 891.0 max latency.
2018-11-24 06:11:54, 356159 records sent, 71231.8 records/sec (34.78 MB/sec), 889.2 ms avg latency, 914.0 max latency.
2018-11-24 06:11:59, 353183 records sent, 70636.6 records/sec (34.49 MB/sec), 898.7 ms avg latency, 912.0 max latency.
2018-11-24 06:12:04, 359011 records sent, 71802.2 records/sec (35.06 MB/sec), 889.8 ms avg latency, 933.0 max latency.
2018-11-24 06:12:09, 365118 records sent, 73023.6 records/sec (35.66 MB/sec), 865.1 ms avg latency, 897.0 max latency.
2018-11-24 06:12:14, 369799 records sent, 73959.8 records/sec (36.11 MB/sec), 862.8 ms avg latency, 885.0 max latency.
2018-11-24 06:12:19, 373457 records sent, 74691.4 records/sec (36.47 MB/sec), 847.9 ms avg latency, 867.0 max latency.
2018-11-24 06:12:24, 354671 records sent, 70934.2 records/sec (34.64 MB/sec), 889.7 ms avg latency, 916.0 max latency.
2018-11-24 06:12:29, 363692 records sent, 72738.4 records/sec (35.52 MB/sec), 880.3 ms avg latency, 938.0 max latency.
2018-11-24 06:12:34, 368869 records sent, 73773.8 records/sec (36.02 MB/sec), 856.1 ms avg latency, 902.0 max latency.
2018-11-24 06:12:39, 360871 records sent, 72174.2 records/sec (35.24 MB/sec), 885.5 ms avg latency, 920.0 max latency.
2018-11-24 06:12:44, 371597 records sent, 74319.4 records/sec (36.29 MB/sec), 852.1 ms avg latency, 885.0 max latency.
2018-11-24 06:12:49, 389329 records sent, 77865.8 records/sec (38.02 MB/sec), 814.3 ms avg latency, 850.0 max latency.
2018-11-24 06:12:54, 386632 records sent, 77326.4 records/sec (37.76 MB/sec), 820.5 ms avg latency, 864.0 max latency.
2018-11-24 06:12:59, 361212 records sent, 72242.4 records/sec (35.27 MB/sec), 875.3 ms avg latency, 900.0 max latency.
2018-11-24 06:13:04, 357275 records sent, 71455.0 records/sec (34.89 MB/sec), 889.2 ms avg latency, 903.0 max latency.
2018-11-24 06:13:09, 376929 records sent, 75385.8 records/sec (36.81 MB/sec), 843.1 ms avg latency, 890.0 max latency.
2018-11-24 06:13:14, 380122 records sent, 76024.4 records/sec (37.12 MB/sec), 837.1 ms avg latency, 891.0 max latency.
2018-11-24 06:13:19, 379347 records sent, 75869.4 records/sec (37.05 MB/sec), 835.5 ms avg latency, 888.0 max latency.
2018-11-24 06:13:24, 381238 records sent, 76247.6 records/sec (37.23 MB/sec), 838.7 ms avg latency, 873.0 max latency.
2018-11-24 06:13:29, 357957 records sent, 71591.4 records/sec (34.96 MB/sec), 876.4 ms avg latency, 938.0 max latency.
2018-11-24 06:13:34, 353772 records sent, 70754.4 records/sec (34.55 MB/sec), 903.3 ms avg latency, 929.0 max latency.
2018-11-24 06:13:39, 368993 records sent, 73798.6 records/sec (36.03 MB/sec), 855.7 ms avg latency, 884.0 max latency.
2018-11-24 06:13:44, 367970 records sent, 73594.0 records/sec (35.93 MB/sec), 872.9 ms avg latency, 915.0 max latency.
2018-11-24 06:13:49, 358112 records sent, 71622.4 records/sec (34.97 MB/sec), 873.0 ms avg latency, 913.0 max latency.
2018-11-24 06:13:54, 363227 records sent, 72645.4 records/sec (35.47 MB/sec), 879.0 ms avg latency, 919.0 max latency.
2018-11-24 06:13:59, 360623 records sent, 72124.6 records/sec (35.22 MB/sec), 876.8 ms avg latency, 905.0 max latency.
2018-11-24 06:14:04, 364808 records sent, 72961.6 records/sec (35.63 MB/sec), 870.7 ms avg latency, 918.0 max latency.
2018-11-24 06:14:09, 381362 records sent, 76272.4 records/sec (37.24 MB/sec), 838.4 ms avg latency, 892.0 max latency.
2018-11-24 06:14:14, 393762 records sent, 78752.4 records/sec (38.45 MB/sec), 807.8 ms avg latency, 862.0 max latency.
2018-11-24 06:14:19, 371969 records sent, 74393.8 records/sec (36.33 MB/sec), 847.9 ms avg latency, 891.0 max latency.
2018-11-24 06:14:24, 365924 records sent, 73184.8 records/sec (35.73 MB/sec), 866.9 ms avg latency, 891.0 max latency.
2018-11-24 06:14:29, 374263 records sent, 74852.6 records/sec (36.55 MB/sec), 848.0 ms avg latency, 884.0 max latency.
2018-11-24 06:14:34, 362764 records sent, 72552.8 records/sec (35.43 MB/sec), 876.3 ms avg latency, 909.0 max latency.
2018-11-24 06:14:39, 359784 records sent, 71956.8 records/sec (35.14 MB/sec), 882.6 ms avg latency, 925.0 max latency.
2018-11-24 06:14:44, 379750 records sent, 75950.0 records/sec (37.08 MB/sec), 835.1 ms avg latency, 871.0 max latency.
2018-11-24 06:14:49, 374108 records sent, 74821.6 records/sec (36.53 MB/sec), 849.4 ms avg latency, 889.0 max latency.
2018-11-24 06:14:54, 375720 records sent, 75144.0 records/sec (36.69 MB/sec), 843.6 ms avg latency, 874.0 max latency.
2018-11-24 06:14:59, 362204 records sent, 72440.8 records/sec (35.37 MB/sec), 874.3 ms avg latency, 904.0 max latency.
2018-11-24 06:15:04, 367350 records sent, 73470.0 records/sec (35.87 MB/sec), 867.9 ms avg latency, 895.0 max latency.
2018-11-24 06:15:09, 379688 records sent, 75937.6 records/sec (37.08 MB/sec), 835.6 ms avg latency, 877.0 max latency.
2018-11-24 06:15:14, 365676 records sent, 73135.2 records/sec (35.71 MB/sec), 864.4 ms avg latency, 926.0 max latency.
2018-11-24 06:15:19, 392243 records sent, 78448.6 records/sec (38.30 MB/sec), 810.6 ms avg latency, 905.0 max latency.
2018-11-24 06:15:24, 360468 records sent, 72093.6 records/sec (35.20 MB/sec), 879.5 ms avg latency, 900.0 max latency.
2018-11-24 06:15:26, 38671875 records sent, 73995.172465 records/sec (36.13 MB/sec), 856.00 ms avg latency, 1214.00 ms max latency, 862 ms 50th, 906 ms 95th, 930 ms 99th, 1178 ms 99.9th.